LaloAlvarez-e/MSP430F169/Utilities/Rename_Files/DAC12/Peripheral/RegisterDefines/Header/DAC12_RegisterDefines_IE.h
/**
 *
 * @file DAC12_RegisterDefines_IE.h
 * @copyright
 * @verbatim InDeviceMex 2021 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 20 abr. 2022 @endverbatim
 *
 * @author
 * @verbatim InDeviceMex @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 20 abr. 2022     InDeviceMex    1.0         initial Version@endverbatim
 */

#ifndef DRIVERLIB_DAC12_PERIPHERAL_REGISTERDEFINES_HEADER_DAC12_REGISTERDEFINES_IE_H_
#define DRIVERLIB_DAC12_PERIPHERAL_REGISTERDEFINES_HEADER_DAC12_REGISTERDEFINES_IE_H_

#include "DriverLib/MCU/Header/MCU_Common.h"

/******************************************************************************************
 ************************************ 3 IE *********************************************
 ******************************************************************************************/
/*-----------*/
#define DAC12_IE_R_CH0_BIT ((uint16_t) 0U)

#define DAC12_IE_CH0_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH0_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH0_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH0_MASK (DAC12_IE_CH0_MASK << DAC12_IE_R_CH0_BIT)
#define DAC12_IE_R_CH0_DIS (DAC12_IE_CH0_DIS << DAC12_IE_R_CH0_BIT)
#define DAC12_IE_R_CH0_ENA (DAC12_IE_CH0_ENA << DAC12_IE_R_CH0_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH1_BIT ((uint16_t) 1U)

#define DAC12_IE_CH1_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH1_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH1_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH1_MASK (DAC12_IE_CH1_MASK << DAC12_IE_R_CH1_BIT)
#define DAC12_IE_R_CH1_DIS (DAC12_IE_CH1_DIS << DAC12_IE_R_CH1_BIT)
#define DAC12_IE_R_CH1_ENA (DAC12_IE_CH1_ENA << DAC12_IE_R_CH1_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH2_BIT ((uint16_t) 2U)

#define DAC12_IE_CH2_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH2_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH2_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH2_MASK (DAC12_IE_CH2_MASK << DAC12_IE_R_CH2_BIT)
#define DAC12_IE_R_CH2_DIS (DAC12_IE_CH2_DIS << DAC12_IE_R_CH2_BIT)
#define DAC12_IE_R_CH2_ENA (DAC12_IE_CH2_ENA << DAC12_IE_R_CH2_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH3_BIT ((uint16_t) 3U)

#define DAC12_IE_CH3_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH3_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH3_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH3_MASK (DAC12_IE_CH3_MASK << DAC12_IE_R_CH3_BIT)
#define DAC12_IE_R_CH3_DIS (DAC12_IE_CH3_DIS << DAC12_IE_R_CH3_BIT)
#define DAC12_IE_R_CH3_ENA (DAC12_IE_CH3_ENA << DAC12_IE_R_CH3_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH4_BIT ((uint16_t) 4U)

#define DAC12_IE_CH4_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH4_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH4_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH4_MASK (DAC12_IE_CH4_MASK << DAC12_IE_R_CH4_BIT)
#define DAC12_IE_R_CH4_DIS (DAC12_IE_CH4_DIS << DAC12_IE_R_CH4_BIT)
#define DAC12_IE_R_CH4_ENA (DAC12_IE_CH4_ENA << DAC12_IE_R_CH4_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH5_BIT ((uint16_t) 5U)

#define DAC12_IE_CH5_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH5_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH5_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH5_MASK (DAC12_IE_CH5_MASK << DAC12_IE_R_CH5_BIT)
#define DAC12_IE_R_CH5_DIS (DAC12_IE_CH5_DIS << DAC12_IE_R_CH5_BIT)
#define DAC12_IE_R_CH5_ENA (DAC12_IE_CH5_ENA << DAC12_IE_R_CH5_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH6_BIT ((uint16_t) 6U)

#define DAC12_IE_CH6_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH6_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH6_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH6_MASK (DAC12_IE_CH6_MASK << DAC12_IE_R_CH6_BIT)
#define DAC12_IE_R_CH6_DIS (DAC12_IE_CH6_DIS << DAC12_IE_R_CH6_BIT)
#define DAC12_IE_R_CH6_ENA (DAC12_IE_CH6_ENA << DAC12_IE_R_CH6_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH7_BIT ((uint16_t) 7U)

#define DAC12_IE_CH7_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH7_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH7_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH7_MASK (DAC12_IE_CH7_MASK << DAC12_IE_R_CH7_BIT)
#define DAC12_IE_R_CH7_DIS (DAC12_IE_CH7_DIS << DAC12_IE_R_CH7_BIT)
#define DAC12_IE_R_CH7_ENA (DAC12_IE_CH7_ENA << DAC12_IE_R_CH7_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH8_BIT ((uint16_t) 8U)

#define DAC12_IE_CH8_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH8_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH8_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH8_MASK (DAC12_IE_CH8_MASK << DAC12_IE_R_CH8_BIT)
#define DAC12_IE_R_CH8_DIS (DAC12_IE_CH8_DIS << DAC12_IE_R_CH8_BIT)
#define DAC12_IE_R_CH8_ENA (DAC12_IE_CH8_ENA << DAC12_IE_R_CH8_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH9_BIT ((uint16_t) 9U)

#define DAC12_IE_CH9_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH9_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH9_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH9_MASK (DAC12_IE_CH9_MASK << DAC12_IE_R_CH9_BIT)
#define DAC12_IE_R_CH9_DIS (DAC12_IE_CH9_DIS << DAC12_IE_R_CH9_BIT)
#define DAC12_IE_R_CH9_ENA (DAC12_IE_CH9_ENA << DAC12_IE_R_CH9_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH10_BIT ((uint16_t) 10U)

#define DAC12_IE_CH10_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH10_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH10_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH10_MASK (DAC12_IE_CH10_MASK << DAC12_IE_R_CH10_BIT)
#define DAC12_IE_R_CH10_DIS (DAC12_IE_CH10_DIS << DAC12_IE_R_CH10_BIT)
#define DAC12_IE_R_CH10_ENA (DAC12_IE_CH10_ENA << DAC12_IE_R_CH10_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH11_BIT ((uint16_t) 11U)

#define DAC12_IE_CH11_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH11_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH11_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH11_MASK (DAC12_IE_CH11_MASK << DAC12_IE_R_CH11_BIT)
#define DAC12_IE_R_CH11_DIS (DAC12_IE_CH11_DIS << DAC12_IE_R_CH11_BIT)
#define DAC12_IE_R_CH11_ENA (DAC12_IE_CH11_ENA << DAC12_IE_R_CH11_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH12_BIT ((uint16_t) 12U)

#define DAC12_IE_CH12_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH12_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH12_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH12_MASK (DAC12_IE_CH12_MASK << DAC12_IE_R_CH12_BIT)
#define DAC12_IE_R_CH12_DIS (DAC12_IE_CH12_DIS << DAC12_IE_R_CH12_BIT)
#define DAC12_IE_R_CH12_ENA (DAC12_IE_CH12_ENA << DAC12_IE_R_CH12_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH13_BIT ((uint16_t) 13U)

#define DAC12_IE_CH13_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH13_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH13_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH13_MASK (DAC12_IE_CH13_MASK << DAC12_IE_R_CH13_BIT)
#define DAC12_IE_R_CH13_DIS (DAC12_IE_CH13_DIS << DAC12_IE_R_CH13_BIT)
#define DAC12_IE_R_CH13_ENA (DAC12_IE_CH13_ENA << DAC12_IE_R_CH13_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH14_BIT ((uint16_t) 14U)

#define DAC12_IE_CH14_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH14_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH14_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH14_MASK (DAC12_IE_CH14_MASK << DAC12_IE_R_CH14_BIT)
#define DAC12_IE_R_CH14_DIS (DAC12_IE_CH14_DIS << DAC12_IE_R_CH14_BIT)
#define DAC12_IE_R_CH14_ENA (DAC12_IE_CH14_ENA << DAC12_IE_R_CH14_BIT)
/*-----------*/

/*-----------*/
#define DAC12_IE_R_CH15_BIT ((uint16_t) 15U)

#define DAC12_IE_CH15_MASK ((uint16_t) 0x01U)
#define DAC12_IE_CH15_DIS ((uint16_t) 0x00U)
#define DAC12_IE_CH15_ENA ((uint16_t) 0x01U)

#define DAC12_IE_R_CH15_MASK (DAC12_IE_CH15_MASK << DAC12_IE_R_CH15_BIT)
#define DAC12_IE_R_CH15_DIS (DAC12_IE_CH15_DIS << DAC12_IE_R_CH15_BIT)
#define DAC12_IE_R_CH15_ENA (DAC12_IE_CH15_ENA << DAC12_IE_R_CH15_BIT)
/*-----------*/

#endif /* DRIVERLIB_DAC12_PERIPHERAL_REGISTERDEFINES_HEADER_DAC12_REGISTERDEFINES_IE_H_ */
